---
kind: property
id: P:Autodesk.Revit.DB.Category.Material
zh: 材质、材料
source: html/00aa768a-fca2-172f-e5d4-a4d787803983.htm
---
# Autodesk.Revit.DB.Category.Material Property

**中文**: 材质、材料

Retrieves or changes the material of the category.

## Syntax (C#)
```csharp
public Material Material { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: material cannot be set for annotation categories.